
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12871663105)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_iam_policy_attachment.ecs_codedeploy
* Replace
  * aws_iam_role.ecs_codedeploy


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy_attachment.ecs_codedeploy will be updated in-place
  ~ resource "aws_iam_policy_attachment" "ecs_codedeploy" {
        id         = "ECSCodeDeploy"
        name       = "ECSCodeDeploy"
      ~ roles      = [
          - "ECSCodeDeploy",
          + "ECSCodeDeployV2",
        ]
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.ecs_codedeploy must be replaced
-/+ resource "aws_iam_role" "ecs_codedeploy" {
      ~ arn                   = "arn:aws:iam::992382441056:role/ECSCodeDeploy" -> (known after apply)
      ~ create_date           = "2025-01-13T13:56:53Z" -> (known after apply)
      ~ id                    = "ECSCodeDeploy" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS",
        ] -> (known after apply)
      ~ name                  = "ECSCodeDeploy" -> "ECSCodeDeployV2" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA6ODU2KZQPEAYH2SWM" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"01e795246d0eada79eb976c88ee64f7ad3d89bee","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->